# print('Строк боятся не нужно!')
#
# info = ('Строки это всего лишь обьекты заключенные в ковычки: ')
# print(info.split())
# print(info.title())
# print(info.upper())
# print(info.lower())
# info = ('Строки это всего лишь обьекты заключенные в ковычки: ').startswith("*")
# print(info)
# info = ('Строки это всего лишь обьекты заключенные в ковычки:').endswith(":")
# print('startswith: ', info.startswith('Строки'))
# print('endswith: ', info.endswith(('кавыки:)','кавычки:)')))
# print(info)
#
#
# info2 = 'Строки это {name} всего лишь обьекты {} заключенные в {temp} ковычки:)'
# print(info2)
# print(info2.format('ALLI', 'ВТОРОЕ', temp='ФУНКЦИЯ ФОРМАТ', name='ALLI'))
#
# info_2 = '''Строка может быть заключена в Три одинарные или в двойные ковычки'''.upper()
# print(info_2)
# # .upper() - Эо метод, переводит все символы, в верхний регистр
#
# info_3 = 'Строки - это всего лишь обьекты, \
#     и с ними можно работать.'.replace('обьекты', 'Обьекты')
# print(info_3)
# .replace() - Заменяет слово ('обьекты', 'Обьекты')
# ____________________________________________________
# .startswith("*") - Найти строку начинающиеся с *
# .endswith("*") - Найти строку заканчивающиеся на *
# .format("*") - Вставить * в строку
# .split("*") - Разделить строку по *
# .center("*") - Растянуть строку по центру в * символов
# .title() - Сделать каждый первый символ заглавным
# .upper() - Сделать всю строку в БОЛЬШОМ регистре
# .lower() - Сделать всю строку в маленьком регистре
# ______________________________________________________
