# 1. Переменные могут начинаться только с букв
# 2. Переменная может начинаться с _ "нижнего подчеркивания", но не рекомендуется применять
# 3. В переменной не может быть символов

# b = -4999
# a = 5

# if b%5 >= 0:
#     print("Делится нацело")
#     print('Это if')
# elif b%5 == 1:
#     print('Остаток 1')
# elif b%5 == 2:
#     print('Остаток 2')
# else:
#     print('Остаток больше 3')
#     print('Это еlse')

# age = 22
# print(ord('a'))
# print(ord('b'))
# print(ord('а'))

# if 'a' <= 'b':
#     print("Совершенолетний")

# if age >= 18:
#     print('Совершенолетний')
# elif age >=12:
#     print('Подросток')

## верно
# if

# if
# elif

# if
# else


# неверно
# elif

# elif
# else

# else


# elif условие:
#     код

# else условие:
#     код



# # 111
# a = 2**3
# b = 3**2

# if a>b:
#     print('а больше б: ', a)
# else:
#     print('б больше а: ', b)


# 22222

# a = 7

# #   T|F       T|F
# if a > 0:
#     if a < 10:
#         print('Единицы')
#     elif a < 100:
#         print('Десятки')
#     elif a < 1000:
#         print('Сотни')

# AND условие AND условие AND условие --> True, если каждое условие True

# OR условие OR условие OR условие --> True,если хотя бы одно условие True

# NOT: not True --> False
#      not False --> True
#  not условие


# print('Привет мир!')
# a = float(input('Введите первое число: '))
# b = float(input('Введите второе число: '))
# print('произведение равно: ', a*b)