# set & dict
# .add("*") # Добавляет элемент в множетсво
# .remove("*") # Удаляет объект из множества
# .clear() # Удаляет всё внутри множетсва.
# .difference("*") # Сравнивает оригинальное множество с * и возвращает объекты которых нет в *
# .update("*") # Добавляет в множетсво всё что вы передали в UPDATE()
# .discard("*") # Удаляет * из множетсва, если * нету во множестве, ошибки не будет как если бы это было remove()
# .intersection("*") # Возрвращает объекты которые есть и во множестве и в *.
# .intersection_update(*) # Удаляет из множетсва непохожие и оставляет только те объекты которые есть и во множестве и в *
# .pop() # Удаляет рандомный объект из множества.
# _______________________________________________
# dates = {21,13,12,12,31}
# dates.add('505')
# dates.pop()
# dates.update(['10','20','30','40'])
# dates.discard({'505','13'})
# dates.update({'555','111'})
# dates.clear()
# for i in dates:
#     print(i)
# __________________________________________________
# seta = {1,2,3,4,5}
# setb = {3,4,5,6,7}
#
# # print(seta.intersection(setb))
# # print(seta.difference(setb))
# #
# # print(setb.intersection(seta))
# # print(setb.difference(seta))
#
# setb.intersection_update(seta)
#
# print(seta)
# print(setb)
# _________________________________









