# Modules

# import os

# os.system() - испольнить комманду терминала
# os.name - имя операционной системы
# os.rmdir('path') - удаляет пустую директорию
# os.urandom(n) - n случайных байт. Возможно использование эой функции в криптографических целях
# _____________________________________________________________________________________________
# МОДУЛЬ OS:
# Модуль используется для исполнения команд терминала через Python код.
# Для работы с Интерпретатором

# НЕКОТОРЫЕ ФУНКЦИИ:
# os.system() - исполнить комманду терминала
# os.name - имя операционной системы.
# os.rmdir('path') - удаляет пустую директорию.
# os.urandom(n) - n случайных байт. Возможно использование этой функции в криптографических целях.

# import sys
#
# print(sys.version)
# print(sys.argv)
# print(sys.executable)
# ________________________________________________________________________________________________
# МОДУЛЬ RANDOM:
# Модуль random связан с генерацией рандомных значений.
#
# НЕКОТОРЫЕ ФУНКЦИИ:
# random.randrange(start, stop, step) - возвращает случайно выбранное число из последовательности.
# random.randint(A,B) - случайное целое число N.
# random.choice(sequence) - случайный элемент непустой последовательности.
# random.shuffle(sequence) - перемешивает последовательность (изменяется сама последовательность)
# ________________________________________________________________________________________________
# import os
# import random
# import sys
#
# print(os.name) # -> Узнать общее имя операционной системы.
#
# print(sys.platform) # -> Узнать ДЕТАЛЬНОЕ имя ОС.
#
# print(random.choice(['name1','name2', 'name3', 'name4']))
#
# # Выбрать рандомный элемент из списка.

