# PROBLEM 0
# Из множества Множество № 1:
# dates_of_birth = {3,10,11,13,31,21,1,10,3,5,6,6} удалите число 7.
# dates_of_birth = {3,10,11,13,31,21,1,10,3,5,6,6}
# dates_of_birth.remove({'7'})
# for i in dates_of_birth:
#     print(i)
# PROBLEM 1
# Найти объекты которые есть и в  farm_1 = {"dog", "cat", "mouse", "sheep"}
# farm_2 = {"cow", "horse", "donkey", "cat", "dog"}
# farm_1 = {"dog", "cat", "mouse", "sheep"}
# farm_2 = {"cow", "horse", "donkey", "cat", "dog"}
# print(farm_1.intersection(farm_2))
# PROBLEM 2
# В SET farm_2 = {"cow", "horse", "donkey", "cat", "dog"}
# найдите объекты которых нет farm_1 = {"dog", "cat", "mouse", "sheep"}
# farm_2 = {"cow", "horse", "donkey", "cat", "dog"}
# farm_1 = {"dog", "cat", "mouse", "sheep"}
# print(farm_2.difference(farm_1))
# PROBLEM 3
# Создайте SET из 5 элементов. Потом добавьте в SET ещё один элемент.
# А затем удалите через .pop() элемент и посмотрите что же вы удалили
# a = {1,2,3,4,5,6}
# a.pop(2)
# for i in a:
#     print(a)