# Problem 1
# a = 2 ** 3
# b = 3 ** 2
# if a > b:
#     print('b bolshe', a)
# else:
#     print("a bolshe", b)
# __________________________________________
# Problem 2
# example
# a = int(input("Your tip: "))
# if a >= 0 and a <= 21 or a>=57 and a<=100:
#     print('Rasreshennye')
# else:
#     print("No!")

# example 2
# if a>0 and a<100:
#     if a< 21 or a>57:
#         print('Yes!')
#     else:
#         print('No!')
# else:
#     print('NOO!')
# __________________________________________________
# Problem 3
# a = 500
# if a % 2 == 0:
#     print("Чётное число")
# else:
#     print("Чётное число")
#
# if a % 3 == 0:
#     print("Делиться без остатка")
# else:
#     print("Не делиться без остатка")
#
# if a ** 2 > 1000:
#     print("Больше 1000")
# else:
#     print("Меньше 1000")
# _______________________________________________
# Problem 4
# a = int(input('Введите число: '))
# if a <= 6:
#     print("А - меньше 6")
# else:
#     print("А - больше 6")
# _______________________________________________
# Problem 5
# a = 10//5
# b = 10/5
# if a == b:
#     print("Равно")
# else:
#     print("Не равно")
# _______________________________________________
# Problem 6
# a = int(input("Введите число: "))
# if a<0:
#     print(a)
# elif a>0:
#     print(a*-1)
# else:
#     print("Это ноль!")
# _______________________________________________________
# # Problems 7
# a = 10
# b = 5
# if a > 0 and b > 0:
#     print("Положительные")
# else:
#     print('Отрицательные')
# _________________________________________________
# Problems 8
# a = 10
# b = 5
# if a >= b:
#     print(a + 2)
# else:
#     print(b + 2)
# __________________________________________________
# Problems 9
# a = int(input('Введите любое число, больше 0: '))
# if a > 0:
#     print('Это положительное число')
# elif a < 0:
#     print('Это отрицательное число')
# else:
#     print(a)
# __________________________________________________
# Problems 10
# a = int(input("Введите возраст ребенка: "))
# if a >= 18:
#     print("Совершеннолетний")
# elif a <= 4:
#     print("Ребёнок")
# else:
#     print("Несовершеннолетний")
# __________________________________________________
# Problems 11
# a = 45
# b = 6
# if a / b == 0:
#     print("Делиться", a / b)
# else:
#     print("Не делиться")
# __________________________________________________
# Problems 12
# a = int(input("Ведите любой год: "))
# b = 2023
# if a > 2023:
#     print("Это будет после 2023-года")
# elif a < 2023:
#     print("Это было до 2023-года")
# elif a == 2023:
#     print("Это нынешний год!")
# else:
#     print("Ничего")
# __________________________________________________
# Problems 14
# a = int(input("Ведите число для А: "))
# b = int(input("Ведите число для Б: "))
# c = int(input("Ведите число для С: "))
# if a >= b and a >= c:
#     print('A самое большое число', a)
# elif b >= a and b >= c:
#     print('B самое большое число', b)
# else:
#     print('C самое большое число, чем A,B - ', c)
#
# if a <= b and a <= c:
#     print('A самое маленькое', a)
# elif b <= a and b <= c:
#     print('B самое маленькое', b)
# else:
#     print('C самое маленькое, чем A,B - ', c)
# __________________________________________________
# Problem 15
# a = 17391%17
# b = 546%17
# c = 934%17
# if a <= b and a <= c:
#     print('A самое маленькое', a)
# elif b <= a and b <= c:
#     print('B самое маленькое', b)
# else:
#     print('C самое маленькое, чем A,B - ', c)
# __________________________________________________
# Problem 16
# x = 13
# y = x ** 2
# if y < 172:
#     y = y ** 2
#     if y < 172:
#         print("х все еще меньше")
#     else:
#         print("x - теперь больше или равно 172")
# else:
#     print("x теперь больше или равно 172")





